Revit 2027 API
GroupTypeId.ElectricalLighting Property
 Electrical - Lighting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalLighting { get; }
Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalLighting {
	ForgeTypeId^ get ();
}
static member ElectricalLighting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace